import img1 from '../../public/img/img1.jpg'
import img2 from '../../public/img/img2.jpg'

export const dataConfig = [
  {
    _id: '1',
    name: '今天在公园看到了儿童嬉戏，笑声洒满阳光。',
    imgs: [img1],
  },
  { _id: '2', name: '漫步在街头，感受了都市的繁华与忙碌。', imgs: [img2] },
  { _id: '3', name: '走进书店，被一本历史书籍深深吸引。', imgs: [img1] },
  { _id: '4', name: '在咖啡馆看到了一对恋人的甜蜜。', imgs: [img2] },
  { _id: '5', name: '去了海边，感受到了大海的浩渺与深邃。', imgs: [img1] },
  { _id: '6', name: '在山顶看到了日出，被其壮观所震撼。', imgs: [img2] },
  {
    _id: '7',
    name: '在夜市品尝了各种美食，感受到了人间烟火。',
    imgs: [img1],
  },
  { _id: '8', name: '在画廊欣赏了一幅油画，被其色彩所吸引。', imgs: [img2] },
  {
    _id: '9',
    name: '在博物馆看到了古代的文物，感受到了历史的厚重。',
    imgs: [img1],
  },
  {
    _id: '10',
    name: '在花店看到了各种鲜花，被其美丽所吸引。',
    imgs: [img2],
  },
  {
    _id: '11',
    name: '在街头看到了一只流浪猫，感到了生活的不易。',
    imgs: [img1],
  },
  {
    _id: '12',
    name: '在电影院看了一部电影，被其剧情所吸引。',
    imgs: [img2],
  },
  {
    _id: '13',
    name: '在湖边看到了天鹅的优雅，感受到了大自然的美丽。',
    imgs: [img1],
  },
  {
    _id: '14',
    name: '在公园看到了一位老人的孤独，感到了生活的苍凉。',
    imgs: [img2],
  },
  {
    _id: '15',
    name: '在动物园看到了各种动物，被其独特性格所吸引。',
    imgs: [img1],
  },
  {
    _id: '16',
    name: '在超市看到了各种商品，感受到了生活的丰富。',
    imgs: [img2],
  },
  {
    _id: '17',
    name: '在街头看到了一位街头艺人的表演，被其才华所吸引。',
    imgs: [img1],
  },
  {
    _id: '18',
    name: '在图书馆看到了各种书籍，感受到了知识的深邃。',
    imgs: [img2],
  },
  {
    _id: '19',
    name: '在体育场看到了一场篮球比赛，被其激烈所吸引。',
    imgs: [img1],
  },
  {
    _id: '20',
    name: '在公园看到了春天的繁花，感受到了生命的活力。',
    imgs: [img2],
  },
  {
    _id: '21',
    name: '在音乐会听到了美妙的旋律，被其魅力所吸引。',
    imgs: [img1],
  },
  {
    _id: '22',
    name: '在街头看到了忙碌的人们，感受到了生活的节奏。',
    imgs: [img2],
  },
  {
    _id: '23',
    name: '在公园看到了秋天的落叶，感受到了季节的变迁。',
    imgs: [img1],
  },
  {
    _id: '24',
    name: '在游乐园看到了孩子们的快乐，感受到了童真的美好。',
    imgs: [img2],
  },
  { _id: '25', name: '在山顶看到了星空，被其浩瀚所震撼。', imgs: [img1] },
  { _id: '26', name: '在海边看到了日落，被其美丽所吸引。', imgs: [img2] },
  {
    _id: '27',
    name: '在森林中看到了鸟儿的飞翔，感受到了自由的意义。',
    imgs: [img1],
  },
  {
    _id: '28',
    name: '在湖边看到了鸭子的嬉戏，感受到了生活的乐趣。',
    imgs: [img2],
  },
  {
    _id: '29',
    name: '在街头看到了夜晚的霓虹，感受到了城市的繁华。',
    imgs: [img1],
  },
  { _id: '30', name: '在公园看到了雪景，被其纯净所吸引。', imgs: [img2] },
  {
    _id: '31',
    name: '在图书馆看到了学生的努力，感受到了知识的力量。',
    imgs: [img1],
  },
  {
    _id: '32',
    name: '在咖啡馆看到了一位写作者的专注，被其才华所吸引。',
    imgs: [img2],
  },
  {
    _id: '33',
    name: '在公园看到了一位画家的创作，感受到了艺术的魅力。',
    imgs: [img1],
  },
  {
    _id: '34',
    name: '在街头看到了一位老人的微笑，感受到了生活的温暖。',
    imgs: [img2],
  },
  {
    _id: '35',
    name: '在电影院看到了一部经典电影，被其深度所吸引。',
    imgs: [img1],
  },
  {
    _id: '36',
    name: '在超市看到了一位母亲的辛劳，感受到了母爱的伟大。',
    imgs: [img2],
  },
  {
    _id: '37',
    name: '在公园看到了一位跑步的人，感受到了健康的重要。',
    imgs: [img1],
  },
  {
    _id: '38',
    name: '在街头看到了一位警察的坚守，感受到了责任的重量。',
    imgs: [img2],
  },
]

export type DataType = (typeof dataConfig)[0]
